Revit 2027 API
Instance.GetTransform Method
 Gets the transform of the instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
public:
Transform^ GetTransform()
member GetTransform : unit -> Transform
Return Value
Transform
 The inherent transform.
See Also
Reference
Instance Class
Autodesk.Revit.DB Namespace